# Terminal & Shell
brew "fish"
brew "starship"
brew "tmux"

# Modern CLI replacements
brew "bat"           # cat
brew "eza"           # ls
brew "fd"            # find
brew "ripgrep"       # grep
brew "btop"          # top
brew "zoxide"        # cd
brew "git-delta"     # git diff
brew "tldr"          # man

# Git
brew "git"
brew "gh"
brew "lazygit"
brew "git-lfs"

# Dev tools
brew "node"
brew "go"
brew "deno"

# Utilities
brew "jq"
brew "yazi"
brew "tree"

# Casks
cask "ghostty"
cask "font-maple-mono-nf-cn"
